Author : Eric Deleon

In [3]:
import pandas as pd
import numpy as np

**Q1:** What is the difference between a Python array, a Pandas Series, and a Pandas Dataframe?

A1: While the Pandas Series object is basically interchangeable with a one-dimensional NumPy array (or Python Array), the essential difference is the presence of the index. The Numpy Array has an implicitly defined integer index used to access the values, while the Pandas Series has an explicitly defined index associated with the values. The Pandas DataFrame can be thought of either as a generalization of a NumPy array, or as a specialization of a Python dictionary. If a Series is an analog of a one-dimensional array with flexible indices, a DataFrame is an analog of a two-dimensional array with both flexible row indices and flexible column names.

**Q2:** Use the following population dictionary to create a Pandas Series object. Call the series object population. Remember to include all needed

In [4]:
population_dict = {'California': 38332521,
                   'Texas':26448193,
                   'New York':19651127,
                   'Florida':19552860,
                   'Illinois':12882135}

In [5]:
#A2: 
object_population = pd.Series(population_dict)
object_population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

**Q3:** Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.

In [10]:
#Sample DataFrame:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [11]:
#A3:
df = pd.DataFrame(exam_data , index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

**Q4:** What is the average number of attempts?

In [24]:
#A4:
df[['attempts']].mean()

attempts    1.9
dtype: float64

**Q5:** How many people qualified?

In [26]:
#A5
qualified = df.query("qualify=='yes'")
qualified['qualify'].count()

5

**Q6:** Change the name of Jonas to James

In [27]:
#A6
df['name'] = df['name'].replace(['Jonas'],'James')
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      James   19.0         1     yes

**Q7:** Show the first two rows by index

In [28]:
#A7
df.iloc[[0,1], :]

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no

**Q8:** Add a new column, contained in the list here and called 'color'

In [1]:
color = ['Red','Blue','Orange','Red','White','White','Blue','Green','Green','Red']

In [13]:
#A8
df['color'] = color
df

        name  score  attempts qualify   color
a  Anastasia   12.5         1     yes     Red
b       Dima    9.0         3      no    Blue
c  Katherine   16.5         2     yes  Orange
d      James    NaN         3      no     Red
e      Emily    9.0         2      no   White
f    Michael   20.0         3     yes   White
g    Matthew   14.5         1     yes    Blue
h      Laura    NaN         1      no   Green
i      Kevin    8.0         2      no   Green
j      Jonas   19.0         1     yes     Red

**Q9:** Create a datafram from the following dictionary. After you do so, write a Pandas program to split the dataframe by school code and get mean, min, and max value of age for each school.

In [15]:
School_Dict= {   'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']}
  
index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6']

In [16]:
#A9
school_df = pd.DataFrame(School_Dict, index=index)

In [17]:
#A9: Mean
school_df.groupby(["school_code"])['age'].mean()

school_code
s001    12.5
s002    13.0
s003    13.0
s004    12.0
Name: age, dtype: float64

In [18]:
#A9: Min
school_df.groupby(["school_code"])['age'].min()

school_code
s001    12
s002    12
s003    13
s004    12
Name: age, dtype: int64

In [19]:
#A9: Max
school_df.groupby(["school_code"])['age'].max()

school_code
s001    13
s002    14
s003    13
s004    12
Name: age, dtype: int64

**Q10a:**Load a dataframe titled **california_cities**

In [8]:
#You need to run this code to load data from the Google drive
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [12]:
#A10a
california_cities = pd.read_csv('drive/My Drive/california_cities.csv')

**Q10b:** Show the first 5 rows of the pandas dataframe

In [13]:
#A10b
california_cities.head(5)

   Unnamed: 0         city  ...  area_water_km2  area_water_percent
0           0     Adelanto  ...           0.046                0.03
1           1  AgouraHills  ...           0.076                0.37
2           2      Alameda  ...          31.983               53.79
3           3       Albany  ...           9.524               67.28
4           4     Alhambra  ...           0.003                0.01

[5 rows x 14 columns]